# SortingOrder Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BrowserOrganization..::..SortingOrder Property
BrowserOrganization Class See Also
---
The sorting order if sorting of items is applicable in the browser.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public SortingOrder SortingOrder { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SortingOrder As SortingOrder
	Get
```

Visual C++
---
```text
public:
property SortingOrder SortingOrder {
	SortingOrder get ();
}
```

# See Also
BrowserOrganization Class
Autodesk.Revit.DB Namespace